{"<s>":0,"<pad>":1,"</s>":2,"<unk>":3,".":4,"Ġthe":5,",":6,"Ġto":7,"Ġand":8,"Ġof":9,"Ġa":10,"Ġin":11,"-":12,"Ġfor":13,"Ġthat":14,"Ġon":15,"Ġis":16,"âĢ":17,"'s":18,"Ġwith":19,"ĠThe":20,"Ġwas":21,"Ġ\"":22,"Ġat":23,"Ġit":24,"Ġas":25,"Ġsaid":26,"Ļ":27,"Ġbe":28,"s":29,"Ġby":30,"Ġfrom":31,"Ġare":32,"Ġhave":33,"Ġhas":34,":":35,"Ġ(":36,"Ġhe":37,"ĠI":38,"Ġhis":39,"Ġwill":40,"Ġan":41,"Ġthis":42,")":43,"ĠâĢ":44,"Ġnot":45,"Ŀ":46,"Ġyou":47,"ľ":48,"Ġtheir":49,"Ġor":50,"Ġthey":51,"Ġwe":52,"Ġbut":53,"Ġwho":54,"Ġmore":55,"Ġhad":56,"Ġbeen":57,"Ġwere":58,"Ġabout":59,",\"":60,"Ġwhich":61,"Ġup":62,"Ġits":63,"Ġcan":64,"Ġone":65,"Ġout":66,"Ġalso":67,"Ġ$":68,"Ġher":69,"Ġall":70,"Ġafter":71,".\"":72,"/":73,"Ġwould":74,"'t":75,"Ġyear":76,"Ġwhen":77,"Ġfirst":78,"Ġshe":79,"Ġtwo":80,"Ġover":81,"Ġpeople":82,"ĠA":83,"Ġour":84,"ĠIt":85,"Ġtime":86,"Ġthan":87,"Ġinto":88,"Ġthere":89,"t":90,"ĠHe":91,"Ġnew":92,"ĠâĢĶ":93,"Ġlast":94,"Ġjust":95,"ĠIn":96,"Ġother":97,"Ġso":98,"Ġwhat":99,"I":100,"Ġlike":101,"a":102,"Ġsome":103,"S":104,".\\":105,"Ġthem":106,"Ġyears":107,"'":108,"Ġdo":109,"Ġyour":110,"00014":111,"Ġ1":112,"\"":113,"Ġif":114,"Ġcould":115,"?":116,"Ġno":117,"i":118,"m":119,"Ġget":120,"ĠU":121,"Ġnow":122,"Ġhim":123,"Ġback":124,"ĠBut":125,"ĠâĢĵ":126,"Ġmy":127,"Ġ'":128,"Ġonly":129,"Ġthree":130,";":131,"Ġ2":132,"The":133,"1":134,"Ġpercent":135,"Ġagainst":136,"Ġbefore":137,"Ġcompany":138,"o":139,"ĠTrump":140,"Ġhow":141,"Ġbecause":142,"Ġany":143,"Ġmost":144,"Ġbeing":145,"Ġmake":146,"Ġwhere":147,"Ġduring":148,"Ġthrough":149,"Ġwhile":150,"000":151,"ĠThis":152,"Ġmillion":153,"ing":154,"Ġ3":155,"Ġmade":156,"Ġwell":157,"Ġ10":158,"Ġdown":159,"Ġoff":160,"Ġsays":161,"Ġme":162,"ĠB":163,"Ġgoing":164,"Ġteam":165,"ĠWe":166,"Ġthose":167,"Ġgovernment":168,"Ġway":169,"We":170,"Ġmany":171,"Ġthen":172,"Ġwork":173,"Ġtold":174,"com":175,"2":176,"Ġgame":177,"ĠAnd":178,"in":179,"year":180,"Ġp":181,"Ġvery":182,"Ġday":183,"Ġhome":184,"Ġtake":185,"Ġweek":186,"Ġsince":187,"ĠNew":188,"Ġmay":189,"Ġeven":190,"Ġseason":191,"Ġsee":192,"Ġ2017":193,"Ġstate":194,"Ġ5":195,"ed":196,"Ġshould":197,"Ġaround":198,"Ġ2018":199,"Ġsecond":200,"Ġus":201,"Ġstill":202,"Ġmuch":203,"Ġ4":204,"Ġgood":205,"Ġthink":206,"%":207,"ĠS":208,"Ġthese":209,"Ġmarket":210,"ĠD":211,"th":212,"Ġgo":213,"'re":214,"Ġsuch":215,"Ġknow":216,"Ġincluding":217,"Ġdon":218,"y":219,"Ġnext":220,"ĠP":221,"Ġdid":222,"Ġunder":223,"Ġsay":224,"en":225,"ĠL":226,"Ġbetween":227,"Ġper":228,"ĠK":229,"ĠC":230,"Ġ6":231,"Ġworld":232,"Ġpart":233,"ĠN":234,"Ġright":235,"Ġwant":236,"Ġfour":237,"),":238,"Ġhigh":239,"Ġneed":240,"re":241,"e":242,"It":243,"Ġhelp":244,"5":245,"3":246,"Ġcountry":247,"ĠR":248,"Ġpolice":249,"A":250,"Ġlong":251,"ĠThey":252,"Ġend":253,"er":254,"ĠT":255,"ĠM":256,"u":257,"Ġboth":258,"Ġhere":259,"an":260,"on":261,"Ġ7":262,"Ġde":263,"ĠShe":264,"Ġbusiness":265,"Ġreport":266,"j":267,"ers":268,"Ġreally":269,"ĠPresident":270,"ar":271,"ĠG":272,"ĠFriday":273,"ĠF":274,"Ġbest":275,"Ġsame":276,"Ġanother":277,"Ġset":278,"old":279,"ĠThat":280,"as":281,"n":282,"Ġcome":283,"Ġfamily":284,"Ġpublic":285,"ĠFor":286,"ĠAs":287,"0":288,"ĠH":289,"Ġ8":290,"Ġ20":291,"Ġfive":292,"es":293,"ĠTuesday":294,"Ġn":295,"ĠThursday":296,"Ġquarter":297,"h":298,"Ġtop":299,"Ġgot":300,"Ġlife":301,"ĠMonday":302,"Ġfound":303,"Ġuse":304,"ĠW":305,"4":306,"ĠWednesday":307,"Ġown":308,"Ġaccording":309,"Ġplay":310,"Ġshow":311,"ĠSt":312,"Ġman":313,"Ġleft":314,"ĠUnited":315,"Ġ12":316,"Ġplace":317,"ĠIf":318,"Ġlot":319,"Ġformer":320,"Ġ0":321,").":322,"Ġsupport":323,"ie":324,"Ġbillion":325,"Ġt":326,"Ġshares":327,"!":328,"z":329,"k":330,"ĠState":331,"Ġpoints":332,"Ġgroup":333,"Ġschool":334,"Ġinformation":335,"Ġ2016":336,"al":337,"r":338,"Ġwin":339,"Ġnews":340,"Ġused":341,"Ġput":342,"Ġcity":343,"ĠJ":344,"ĠThere":345,"Ġnumber":346,"C":347,"'ve":348,"Ġeach":349,"Ġtoo":350,"Ġwon":351,"ly":352,"Ġmonth":353,"is":354,"Ġadded":355,"Ġlook":356,"Ġbetter":357,"Ġevery":358,"Ġ&":359,"Ġdays":360,"Ġ9":361,"Ġtook":362,"Ġnight":363,"Ġe":364,"Ġ11":365,"os":366,"Ġfew":367,"or":368,"ĠNorth":369,"ĠYou":370,"Ġthird":371,"Ġgreat":372,"Ġcalled":373,"ĠOn":374,"Ġpast":375,"Ġcame":376,"Ġmonths":377,"ĠSaturday":378,"Ġ15":379,"Ġbig":380,"ĠE":381,"ĠUS":382,"Ġthings":383,"ĠO":384,"Ġd":385,"Ġstart":386,"B":387,"Ġstock":388,"Ġ30":389,"Ġwomen":390,"ĠSouth":391,"ĠMay":392,"Ġnever":393,"Ġpresident":394,"ĠSunday":395,"Ġwithout":396,"man":397,"8":398,"Ġdidn":399,"Ġlocal":400,"6":401,"Ġsomething":402,"Ġcase":403,"ĠAll":404,"it":405,"7":406,"ĠSo":407,"Ġchildren":408,"Ġaway":409,"Ġlittle":410,"Ġsix":411,"ĠCity":412,"ĠCounty":413,"Ġdata":414,"at":415,"Ġalready":416,"d":417,"Ġmoney":418,"Ġearly":419,"Ġacross":420,"Ġexpected":421,"Ġrun":422,"Ġlater":423,"am":424,"Ġprice":425,"Ġgames":426,"ĠMr":427,"b":428,"Ġmight":429,"Ġdifferent":430,"Ġreported":431,"Ġdeal":432,"Ġmedia":433,"Ġgrowth":434,"Ġcommunity":435,"ĠChina":436,"APPD":437,"c":438,"Ġwent":439,"ĠNo":440,"Ġable":441,"Ġmaking":442,"Ġarea":443,"Ġfar":444,"Ġstatement":445,"ĠHouse":446,"Ġworking":447,"M":448,"Ġk":449,"Ġseen":450,"Ġcompanies":451,"Ġtoday":452,"Ġmembers":453,"Ġuntil":454,"Ġfull":455,"Ġagain":456,"Ġhalf":457,"Ġshare":458,"le":459,"Ġalways":460,"Ġcourt":461,"l":462,"and":463,"Ġchange":464,"Ġfind":465,"9":466,"Ġsystem":467,"ĠV":468,"ĠYork":469,"ĠAmerican":470,"Ġhead":471,"Ġplayers":472,"Ġdoes":473,"Ġhealth":474,"Ġm":475,"Ġpower":476,"Ġpoint":477,"Ġhit":478,"Ġ.":479,"AVA":480,"Ġfree":481,".,":482,"Ġlead":483,"Ġseveral":484,"Ġrecent":485,"Ġcall":486,"N":487,"Ġlaw":488,"Ġkeep":489,"Ġopen":490,"ĠNews":491,"Ġgive":492,"ia":493,"ĠMarch":494,"D":495,"ĠNational":496,"ĠAt":497,"Ġtimes":498,"Ġfuture":499,"R":500,"Ġ14":501,"ĠJune":502,"Ġofficials":503,"Ġ18":504,"Ġimportant":505,"f":506,"Ġfinal":507,"Ġ13":508,"ĠOne":509,"P":510,"Ġfollowing":511,"Ġcar":512,"Ġleast":513,"Ġwater":514,"Ġevent":515,"Ġline":516,"Ġmove":517,"Ġservices":518,"Ġhaving":519,"ĠWhen":520,"Ġstudents":521,"ĠPolice":522,"el":523,"Ġam":524,"ĠZ":525,"Ġside":526,"Ġstory":527,"Ġdue":528,"Ġmeeting":529,"K":530,"Ġmust":531,"ĠStates":532,"Ġlikely":533,"G":534,"Ġcontinue":535,"Ġago":536,"Ġparty":537,"Ġmajor":538,"Ġindustry":539,"Ġless":540,"30":541,"Ġun":542,"Ġhard":543,"Ġservice":544,"Ġ16":545,"Ġlooking":546,"Ġheld":547,"ve":548,"Ġwhether":549,"ĠJuly":550,"Ġtaken":551,"Ġalong":552,"Ġasked":553,"Ġstarted":554,"Ġbecome":555,"Ġforward":556,"Ġresearch":557,"Ġoffice":558,"Ġpolitical":559,"to":560,"Ġtogether":561,"Ġgetting":562,"Ġplan":563,"Ġ25":564,"T":565,"Ġamong":566,"Ġcoming":567,"Ġdecision":568,"Ġvideo":569,"Ġ2015":570,"g":571,"ĠAfter":572,"Ġsecurity":573,"L":574,"Ġcare":575,"Ġgiven":576,"Ġavailable":577,"âĢĶ":578,"Ġs":579,"ĠWest":580,"'ll":581,"Ġpay":582,"Ġnear":583,"Ġsaying":584,"Ġannounced":585,"Ġprogram":586,"ĠApril":587,"Ġreal":588,"ĠUniversity":589,"ĠWith":590,"AP":591,"Ġsocial":592,"Ġclose":593,"et":594,"Ġcurrent":595,"Ġwhy":596,"F":597,"ĠTo":598,"ĠTwitter":599,"Ġthough":600,"Ġ17":601,"Ġtaking":602,"ĠInc":603,"Ġmen":604,"w":605,"Ġcomes":606,"ley":607,"Ġdoing":608,"Ġprocess":609,"ĠJohn":610,"ch":611,"00":612,"Ġfinancial":613,"Ġlow":614,"Ġenough":615,"ĠWhile":616,"Ġfurther":617,"Ġpost":618,"Ġfeel":619,"st":620,"Ġperson":621,"ĠFacebook":622,"ĠWorld":623,"Ġwithin":624,"ad":625,"Ġdone":626,"the":627,"Ġlate":628,"Ġtax":629,"Ġdoesn":630,"Ġthing":631,"Ġnational":632,"Ġjob":633,"Ġusing":634,"ĠHowever":635,"ic":636,"Ġcampaign":637,"Ġrecord":638,"Ġbehind":639,"://":640,"ĠDepartment":641,"p":642,"Ġothers":643,"ĠJanuary":644,"Ġorder":645,"Ġ[":646,"Ġsales":647,"Ġyet":648,"Ä":649,"Ġsmall":650,"Ġseries":651,"Ġface":652,"ĠWhat":653,"Ġ50":654,"Ġever":655,"Ġearlier":656,"Ġlove":657,"up":658,"Ġrights":659,"ĠAn":660,"ist":661,"Ġmorning":662,"ĠWashington":663,"Ġyoung":664,"Ġlatest":665,"ĠIndia":666,"Ġtrying":667,"Ġfire":668,"Ġled":669,"Ġstrong":670,"Ġreturn":671,"Ġlevel":672,"O":673,"Ġaverage":674,"Ġperiod":675,"Ġexperience":676,"ak":677,"Ġpossible":678,"Ġbelieve":679,"Ġinclude":680,"Ġoil":681,"Ġrecently":682,"Ġonce":683,"Ġknown":684,"Ġlost":685,"Ġsure":686,"us":687,"Ġweeks":688,"Ġfood":689,"Ġreports":690,"Ġrating":691,"ĠMinister":692,"Ġwoman":693,"Ġprovide":694,"Ġproject":695,"Ġissue":696,"Ġlive":697,"10":698,"Ġclear":699,"he":700,"Ġcost":701,"Ġplayed":702,"Ġreleased":703,"Ġcoach":704,"v":705,"Ġ24":706,"Ġseven":707,"Ġplans":708,"Ġdevelopment":709,"ur":710,"ĺ":711,"Ġincrease":712,"This":713,"Ġpolicy":714,"Ġcent":715,"Ġbased":716,"E":717,"il":718,"ĠDecember":719,"Ġglobal":720,"Ġtrade":721,"Ġhours":722,"Ġhigher":723,"Ġgoal":724,"H":725,"ĠAl":726,"Ġ100":727,"Ġminutes":728,"Ġelection":729,"ĠAmerica":730,"Ġrate":731,"ĠCh":732,"Ġ21":733,"CER":734,"ĠWhite":735,"Ġdirector":736,"Ġposition":737,"Ġshot":738,"Ġlarge":739,"Ġc":740,"Ġb":741,"]":742,"Ġissues":743,"Ġdeath":744,"Ġbuilding":745,"Ġtotal":746,"Ġoften":747,"Ġv":748,"Ġcountries":749,"Ġhistory":750,"Ġoutside":751,"Ġfederal":752,"Ġ19":753,"Ġfact":754,"ĠHigh":755,"Ġcareer":756,"im":757,"Ġinternational":758,"ĠNovember":759,"Ġfront":760,"Ġkind":761,"Ġkey":762,"ra":763,"ĠSan":764,"Ġshort":765,"Ġname":766,"ĠAccording":767,"Ġcourse":768,"Ġre":769,"Ġwanted":770,"W":771,"ĠSeptember":772,"Ġinterest":773,"Ġrole":774,"Ġresults":775,"Ġeconomic":776,"Ġ2014":777,"Ġchance":778,"ĠOctober":779,"Ġspecial":780,"Ġofficial":781,"Ġneeds":782,"um":783,"Ġl":784,"Ġproducts":785,"Ġnon":786,"Ġ@":787,"ĠBank":788,"Ġahead":789,"Ġhouse":790,"U":791,"Ġboard":792,"Ġold":793,"Ġsaw":794,"Ġlower":795,"ĠEuropean":796,"Ġcontrol":797,"ĠRussia":798,"Ġeight":799,"Ġrelease":800,"Ġpotential":801,"Ġthought":802,"Ġinvestigation":803,"Ġonline":804,"based":805,"Ġtechnology":806,"ĠDonald":807,"id":808,"Ġbody":809,"Ġrisk":810,"ian":811,"Ġcapital":812,"Ġstaff":813,"Ġaction":814,"ĠLeague":815,"Ġplaying":816,"Ġmakes":817,"Ġalmost":818,"Ġperformance":819,"Ġ22":820,"Ġg":821,"Ġfilm":822,"Ġnearly":823,"ĠCenter":824,"Ġvisit":825,"ĠGroup":826,"Ġbank":827,"Ġbit":828,"Ġreceived":829,"ĠAugust":830,"Ġmilitary":831,"ĠHis":832,"ine":833,"Ġchief":834,"ĠSchool":835,"Ġbring":836,"ĠCourt":837,"Ġ(@":838,"Ġmeans":839,"ĠSh":840,"Ġfans":841,"Ġse":842,"Ġ40":843,"20":844,"\".":845,"V":846,"Ġcut":847,"Ġkilled":848,"Ġ#":849,"Ġprices":850,"Ġgave":851,"ĠStreet":852,"ir":853,"ĠY":854,"Ġcurrently":855,"Ġf":856,"ay":857,"ne":858,"te":859,"Ġtry":860,"ĠPark":861,"ĥ":862,"J":863,"Ġquestion":864,"Ġhand":865,"Ġeconomy":866,"Ġinvestors":867,"able":868,"Ġplayer":869,"ĠBy":870,"ĠDavid":871,"Ġloss":872,"ab":873,"Ġbelow":874,"Ġwrote":875,"co":876,"ate":877,"Ġrunning":878,"un":879,"Ġbegan":880,"Ġsingle":881,"Ġfield":882,"Ġ23":883,"Ġleader":884,"Ġw":885,"ĠCalifornia":886,"Ġfourth":887,"Ġactually":888,"Ġlist":889,"ll":890,"Ġcouple":891,"Ġstudy":892,"Ġteams":893,"He":894,"ah":895,"ĠCanada":896,"Ġla":897,"Ġresult":898,"Ġaccess":899,"Ġvote":900,"ĠMore":901,"ĠFebruary":902,"Ġrevenue":903,"Ġoffer":904,"Ġlet":905,"ier":906,"Ġbuy":907,"Ġattack":908,"Ġblack":909,"Ġr":910,"Ġareas":911,"Ġstop":912,"Ġimpact":913,"Ġmatch":914,"Ġinvestment":915,"Ġcustomers":916,"Ġleaders":917,"ies":918,"Ġmember":919,"Ġchild":920,"Ġroad":921,"ul":922,"Ġvalue":923,"Ġshows":924,"ĠDr":925,"ĠDe":926,"ant":927,"ĠLondon":928,"Ġroom":929,"Ġmusic":930,"Ġproduction":931,"Ġanything":932,"Ġfirm":933,"Ġbiggest":934,"Ġair":935,"Ġproblem":936,"Ġgeneral":937,"Ġwasn":938,"Ġi":939,"Ġprivate":940,"Ġespecially":941,"Ġadministration":942,"Ġadditional":943,"ĠCo":944,"Ġopportunity":945,"Ġhold":946,"&":947,"Ġmatter":948,"Ġsenior":949,"Ġclub":950,"Ġsomeone":951,"ĠÃ":952,"ĠEast":953,"Ġ2019":954,".'":955,"Ġneeded":956,"ĠJames":957,"time":958,"Ġhowever":959,"Ġeverything":960,"Ġeveryone":961,"Ġdied":962,"Ġinvolved":963,"Ġfriends":964,"Ġisn":965,"Ġworth":966,"ik":967,"ĠCup":968,"Ġshowed":969,"There":970,"Ġ28":971,"Ġmeet":972,"Ġ26":973,"Ġ27":974,"Y":975,"Ġregion":976,"ĠPress":977,"ĠNow":978,"Ġson":979,"Ġspace":980,"Ġleading":981,"Ġstates":982,"Ġweekend":983,"ĠÂ£":984,"Ġmother":985,"Ġprevious":986,"ĠUK":987,"ĠMichael":988,"Ġleave":989,"est":990,"em":991,"Ġz":992,"ĠSome":993,"ors":994,"out":995,"15":996,"Ġwar":997,"Ġwebsite":998,"Ġstar":999,"X":1000,"ro":1001,"Ġtarget":1002,"Ġhimself":1003,"Ġturn":1004,"ĠEurope":1005,"Ġworked":1006,"Ġenergy":1007,"Ġscored":1008,"Ġ*":1009,"Ġsoon":1010,"Ġball":1011,"ĠTV":1012,"Ġannual":1013,"Ġ2013":1014,"Ġrace":1015,"ĠInternational":1016,"'d":1017,"ĠMarket":1018,"Ġconference":1019,"io":1020,"Ġo":1021,"Ġchanges":1022,"ig":1023,"Ġofficers":1024,"Ġinside":1025,"Ġform":1026,"Ġpublished":1027,"Ġphone":1028,"Ġco":1029,"Ġlegal":1030,"Ġexecutive":1031,"Ġfight":1032,"ings":1033,"Ġhope":1034,"Ġsummer":1035,"Ġofficer":1036,"Ġfootball":1037,"Ġproperty":1038,"@":1039,"Ġbook":1040,"Ġparents":1041,"Ġcosts":1042,"ac":1043,"Ġmanager":1044,"Ġcreate":1045,"Ġage":1046,"Ġemail":1047,"Ġmarkets":1048,"Ġmain":1049,"Ġhuman":1050,"Ġsent":1051,"Ġmanagement":1052,"ĠDay":1053,"ton":1054,"Ġcash":1055,"Ġfocus":1056,"Ġexpect":1057,"Ġtraining":1058,"Ġbecame":1059,"Ġwhose":1060,"Ġevents":1061,"Ġround":1062,"ĠLe":1063,"Ġfell":1064,"Ġabove":1065,"Ġanalysts":1066,"Ġtalk":1067,"Ġsituation":1068,"ri":1069,"ated":1070,"ke":1071,"Ġwants":1072,"ag":1073,"Ġlives":1074,"om":1075,"Ġal":1076,"Ġdemand":1077,"Ġsafety":1078,"Ġrest":1079,"ĠCouncil":1080,"Ġpersonal":1081,"Ġsite":1082,"ĠRussian":1083,"Ġmid":1084,"Ġnothing":1085,"Ġwhole":1086,"Ġbill":1087,"Ġsold":1088,"ĠBritish":1089,"se":1090,"Ġremain":1091,"12":1092,"Ġforeign":1093,"Ġshooting":1094,"Ġstay":1095,"50":1096,"ang":1097,"Ġhospital":1098,"Ġbad":1099,"Ġaddress":1100,"ĠKorea":1101,"Ġhappened":1102,"Ġcharges":1103,"Ġwhite":1104,"Ġ31":1105,"If":1106,"Ġearnings":1107,"Ġbreak":1108,"Ġlight":1109,"Ġterms":1110,"ĠChinese":1111,"ĠSenate":1112,"ana":1113,"Ġidea":1114,"ap":1115,"of":1116,"Ġnine":1117,"Ġcompared":1118,"Ġbuild":1119,"ard":1120,"In":1121,"Ġsimilar":1122,"Ġgas":1123,"Ġvictory":1124,"Ġ2012":1125,"Ġdebt":1126,"ĠMar":1127,"Ġarrested":1128,"Ġcomment":1129,"Ġincreased":1130,"Ġmedical":1131,"Ġ29":1132,"ĠJan":1133,"Ġgroups":1134,"Ġdespite":1135,"Ġfall":1136,"Ġtell":1137,"Ġworkers":1138,"Ġtown":1139,"Ã©":1140,"Ġwife":1141,"Ġquestions":1142,"Ġcontinued":1143,"Ġheart":1144,"Ġmet":1145,"Ġbrought":1146,"Ġhelped":1147,"ĠCongress":1148,"Ġstep":1149,"Ġfather":1150,"Ġmoment":1151,"Ġproduct":1152,"Ġprobably":1153,"Ġlargest":1154,"Ġvehicle":1155,"ĠEngland":1156,"Ġallow":1157,"Ġstarting":1158,"Ġkids":1159,"Ġincident":1160,"Ġnet":1161,"Ġrates":1162,"ĠRead":1163,"Ġpressure":1164,"Ġincluded":1165,"Ġread":1166,"Ġissued":1167,"ol":1168,"Ġeither":1169,"Ġefforts":1170,"Ġincludes":1171,"ĠRepublican":1172,"ish":1173,"âĢ¦":1174,"Ġgoals":1175,"aj":1176,"Ġen":1177,"x":1178,"Ġraised":1179,"au":1180,"Ġlonger":1181,"ut":1182,"Ġwatch":1183,"ĠTexas":1184,"You":1185,"Ġrange":1186,"nd":1187,"Ġfunds":1188,"Ġremains":1189,"ĠMark":1190,"Ġ60":1191,"Ġque":1192,"sh":1193,"Ġinterview":1194,"Ġrather":1195,"Ġresidents":1196,"Ġgrowing":1197,"Ġpre":1198,"Ġpaid":1199,"Ġcases":1200,"ĠReuters":1201,"Ġdifficult":1202,"Ġsign":1203,"ĠGoogle":1204,"Ġhttps":1205,"ĠPaul":1206,"Ġliving":1207,"day":1208,"ĠQ":1209,"iz":1210,"ĠRed":1211,"Ġland":1212,"They":1213,"ĠRoad":1214,"_":1215,"ĠThese":1216,"Ġview":1217,"Ġagency":1218,"Ġreason":1219,"Ġallowed":1220,"ĠAustralia":1221,"az":1222,"ĠRe":1223,"Ġturned":1224,"11":1225,"Ġnation":1226,"Ġready":1227,"Ġpress":1228,"Ġbudget":1229,"Ġdaily":1230,"ĠChief":1231,"Ġfamilies":1232,"Ġsignificant":1233,"ĠFirst":1234,"Ġthemselves":1235,"Ġj":1236,"Ġruns":1237,"Ġaccused":1238,"Ġtakes":1239,"Ġspent":1240,"Ġvia":1241,"ot":1242,"ina":1243,"25":1244,"land":1245,"Ġexample":1246,"Ġauthorities":1247,"Ġdate":1248,"Ġended":1249,"all":1250,"ECOM":1251,"Ġbusinesses":1252,"ans":1253,"Ġdetails":1254,"Ġground":1255,"Ġpretty":1256,"ĠApple":1257,"ation":1258,"ĠSmith":1259,"ĠCompany":1260,"ĠFlorida":1261,"Ġdrug":1262,"Ġresponse":1263,"one":1264,"Ġeducation":1265,"Ġmean":1266,"Ġleague":1267,"Ġanyone":1268,"Ġminister":1269,"Ġtitle":1270,"Ġadding":1271,"Ġproblems":1272,"Ġopening":1273,"Ġconditions":1274,"Ġred":1275,"Ġdecided":1276,"Å":1277,"Ġposted":1278,"term":1279,"Ġamount":1280,"ĠEU":1281,"Ġsuccess":1282,"Ġevidence":1283,"ĠObama":1284,"Ġaddition":1285,"Ġprovided":1286,"ĠLos":1287,"Ġagreement":1288,"Ġstage":1289,"ens":1290,"Ġrelationship":1291,"ĠGeneral":1292,"Ġsector":1293,"Ġstudent":1294,"ating":1295,"Ġtest":1296,"\",":1297,"Ġwinning":1298,"Ġfelt":1299,"Ġsource":1300,"Z":1301,"Ġseems":1302,"Ġcause":1303,"Ġschools":1304,"Ġdrive":1305,"Ġensure":1306,"Ġhuge":1307,"ĠMy":1308,"ĠHealth":1309,"Ġscene":1310,"Ġgiving":1311,"Ġcenter":1312,"Ġpositive":1313,"Ġyards":1314,"Ġjobs":1315,"Ġaccount":1316,"Ġheard":1317,"Ġquality":1318,"Ġways":1319,"Ġimmediately":1320,"Ġemployees":1321,"are":1322,"Ġpass":1323,"ĠCEO":1324,"Ġreceive":1325,"Ġlooks":1326,"ĠAfrica":1327,"Ġthroughout":1328,"led":1329,"Ġrelated":1330,"Ġsell":1331,"ĠUnion":1332,"ĠPhoto":1333,"ter":1334,"Ġquickly":1335,"ĠHow":1336,"Ġvarious":1337,"Ġreach":1338,"Ġpick":1339,"Ġcharged":1340,"Ġquite":1341,"ent":1342,"q":1343,"ins":1344,"Ġphoto":1345,"Ġunderstand":1346,"ĠâĢ¢":1347,"Ġreached":1348,"Ġtrack":1349,"uk":1350,"Ġeffort":1351,"ville":1352,"Ġcentral":1353,"Ġdaughter":1354,"Ġcontract":1355,"Ġinjury":1356,"Ġopened":1357,"Ġ($":1358,"Ġstraight":1359,"17":1360,"Ġcredit":1361,"ĠIndian":1362,"Ġsexual":1363,"Ġworks":1364,"Ġeasy":1365,"18":1366,"Ġclosed":1367,"Ġh":1368,"Ġhappen":1369,"Ġforce":1370,"ler":1371,"Ġhappy":1372,"Ġshared":1373,"Ġoverall":1374,"Ġmoving":1375,"á":1376,"Ġprojects":1377,"ĠBlack":1378,"Ġconcerns":1379,"Ġclass":1380,"Ġtried":1381,"Ġappeared":1382,"Ġcontent":1383,"ĠDistrict":1384,"Ġterm":1385,"Ġinstead":1386,"ĠOffice":1387,"Ġcontinues":1388,"Ġlevels":1389,"Ġafternoon":1390,"Ġfund":1391,"Ġsale":1392,"Ġdriver":1393,"Ġask":1394,"Ġcannot":1395,"ner":1396,"end":1397,"ĠHere":1398,"field":1399,"Ġstore":1400,"www":1401,"Ġcertain":1402,"Ġself":1403,"Ġdollar":1404,"ĠHer":1405,"Ġpopular":1406,"Ġfollow":1407,"Ġspending":1408,"by":1409,"Ġmoved":1410,"Ġgoes":1411,"Ġcreated":1412,"Ġstand":1413,"Ġoperations":1414,"Ġlooked":1415,"Ġtreatment":1416,"ov":1417,"Ġdistrict":1418,"Ġsigned":1419,"Ġhands":1420,"Ġmodel":1421,"ĠAngeles":1422,"Ġy":1423,"Ġborder":1424,"Ġincome":1425,"ĠLast":1426,"Ġcharge":1427,"Ġdriving":1428,"ĠJapan":1429,"Ġrise":1430,"Ġtalks":1431,"Ġfollowed":1432,"Ġpreviously":1433,"Ġusers":1434,"Ġfunding":1435,"ĠJohnson":1436,"Ġ":1437,"ou":1438,"ai":1439,"Ġnamed":1440,"Ġfriend":1441,"ĠNov":1442,"Ġdefense":1443,"ĠBritain":1444,"Ġentire":1445,"Ġtrading":1446,"Ġfailed":1447,"ĠEl":1448,"Ġclaims":1449,"Ġcomments":1450,"Ġbeat":1451,"ib":1452,"Ġbasis":1453,"ĠJones":1454,"Ġpresent":1455,"ĠBe":1456,"Ġdouble":1457,"Ġrose":1458,"ite":1459,"Ġability":1460,"Ġoriginal":1461,"Ġdead":1462,"ĠCommission":1463,"ĠMe":1464,"Ġcompetition":1465,"Ġ2011":1466,"Ġknew":1467,"Ġmaterial":1468,"av":1469,"ĠFrance":1470,"Ġscore":1471,"Ġsense":1472,"Ġserious":1473,"Ġconfirmed":1474,"Ġanti":1475,"Ġviolence":1476,"Ġimprove":1477,"son":1478,"Ã³":1479,"ĠAP":1480,"Ġsh":1481,"Ġhost":1482,"ĠMike":1483,"Ġpatients":1484,"ĠNFL":1485,"Ġcrisis":1486,"Ġrevealed":1487,"ach":1488,"ĠPrime":1489,"Ġbuilt":1490,"ĠNot":1491,"Ġrules":1492,"Ġelse":1493,"Ġdepartment":1494,"Ġitself":1495,"ise":1496,"500":1497,"Ġcomplete":1498,"ion":1499,"Ġtrial":1500,"ĠBay":1501,"ĠDec":1502,"Ġattention":1503,"Ġtravel":1504,"ĠCentral":1505,"ry":1506,"Ġagreed":1507,"Ġmind":1508,"ĠMc":1509,"Ġ70":1510,"Ġcontact":1511,"ari":1512,"ĠTimes":1513,"Ġspot":1514,"ĠFrench":1515,"Ġgets":1516,"op":1517,"Ġbrand":1518,"Ġcalls":1519,"Ġbanks":1520,"Ġdesign":1521,"Ġsafe":1522,"Ġoffers":1523,"Ġpractice":1524,"ĠOf":1525,"Ã¡":1526,"ling":1527,"Ġtrue":1528,"off":1529,"Ġnumbers":1530,"Ġfun":1531,"Ġlearn":1532,"Ġmultiple":1533,"ĠIs":1534,"res":1535,"als":1536,"Ġcommon":1537,"ized":1538,"Ġchallenge":1539,"Ġcommittee":1540,"ĠOur":1541,"Ġbase":1542,"ani":1543,"ĠAssociation":1544,"ung":1545,"Ġnetwork":1546,"ĠBrown":1547,"Ġapproach":1548,"16":1549,"Ġfinished":1550,"Ġreview":1551,"Ġrequired":1552,"Ġapp":1553,"ĠMan":1554,"ĠâĢ¦":1555,"twitter":1556,"ĠDemocratic":1557,"13":1558,"Ġevening":1559,"ĠTom":1560,"Ã¤":1561,"ĠAssociated":1562,"ĠCanadian":1563,"Ġcollege":1564,"Ġspokesman":1565,"Ġarticle":1566,"Ġtowards":1567,"ĠChicago":1568,"Ġmovie":1569,"14":1570,"ity":1571,"Ġforces":1572,"ĠChris":1573,"ĠDemocrats":1574,"Ġfeatures":1575,"Ġhearing":1576,"ĠX":1577,"ĠAlso":1578,"Ġmessage":1579,"age":1580,"Ġnoted":1581,"ĠSuper":1582,"Ġthousands":1583,"aw":1584,"ĠBill":1585,"ĠAr":1586,"ĠLa":1587,"ip":1588,"Ġ/":1589,"ĠDuring":1590,"Ġnote":1591,".)":1592,"Ġwrong":1593,"if":1594,"Ġpassed":1595,"ĠTwo":1596,"Ġdie":1597,",'":1598,"ĠDon":1599,"ĠGermany":1600,"Ġletter":1601,"Ġdescribed":1602,"ĠIran":1603,"ĠWilliams":1604,"Ġparticularly":1605,"Ġadd":1606,"Ġconversation":1607,"ĠSe":1608,"Ġhighest":1609,"be":1610,"Ġhomes":1611,"Ġsports":1612,"Ġgone":1613,"ĠAd":1614,"Ġel":1615,"Ġopportunities":1616,"Ġwords":1617,"Ġleaving":1618,"ĠChristmas":1619,"As":1620,"ĠGovernment":1621,"Ġsimply":1622,"Ġhusband":1623,"ĠResearch":1624,"ĠMexico":1625,"ates":1626,"ale":1627,"ĠGreen":1628,"$":1629,"od":1630,"ĠHall":1631,"Ġnatural":1632,"Ġoperating":1633,"les":1634,"ations":1635,"ĠKim":1636,"Ġgold":1637,"ok":1638,"Ġprovides":1639,"(":1640,"ell":1641,"Ġbegin":1642,"ĠParty":1643,"back":1644,"ĠAmazon":1645,"19":1646,"Ġmajority":1647,"ĠEven":1648,"Ġcheck":1649,"Ġweather":1650,"Ġorganization":1651,"Ġstories":1652,"ĠCar":1653,"Ġforced":1654,"ĠGeorge":1655,"Ġwalk":1656,"ong":1657,"Ġfiled":1658,"ĠJustice":1659,"Ġlaunched":1660,"Ġoffered":1661,"Ġwww":1662,"Ġconstruction":1663,"ĠBen":1664,"Ġserved":1665,"HAN":1666,"Ġparts":1667,"Ġcancer":1668,"Ġguys":1669,"HEAP":1670,"ash":1671,"less":1672,"Ġleadership":1673,"ĠCommittee":1674,"Ġregular":1675,"Ġcouncil":1676,"Ġcars":1677,"ĠDirector":1678,"Ġjudge":1679,"Ġvictims":1680,"ĠDaily":1681,"Ġkept":1682,"Ġeffect":1683,"Ġbeyond":1684,"pm":1685,"Ġtalking":1686,"Ġconsidered":1687,"ore":1688,"HIT":1689,"Ġst":1690,"ED":1691,"Ġmiddle":1692,"Ġraise":1693,"we":1694,"Ġclaimed":1695,"ino":1696,"Ġalleged":1697,"ĠPro":1698,"ĠScott":1699,"ĠOct":1700,"Ġconsider":1701,"ĠShare":1702,"Ġtraffic":1703,"ĠAfrican":1704,"Ġcouldn":1705,"Ġtoward":1706,"Ġsearch":1707,"But":1708,"Ġlaunch":1709,"Ġinjured":1710,"That":1711,"Ġalthough":1712,"Ġactivities":1713,"Ġchanged":1714,"Ġsources":1715,"Ġmissing":1716,"Ġu":1717,"Ġ35":1718,"Ġcover":1719,"ised":1720,"Ġ|":1721,"ow":1722,"ES":1723,"Ġdecades":1724,"ich":1725,"Ġcaused":1726,"Ġelections":1727,"ane":1728,"IS":1729,"Ġfeet":1730,"ĠBar":1731,"Ġversion":1732,"Ġgrow":1733,"Ġvehicles":1734,"Ġoptions":1735,"Ġindividual":1736,"Ġenvironment":1737,"ĠRobert":1738,"ĠValley":1739,"ĠFrom":1740,"per":1741,"ara":1742,"Ġsystems":1743,"Ġprotect":1744,"ĠKing":1745,"Ġinjuries":1746,"Ġfinally":1747,"Ġnuclear":1748,"40":1749,"Ġratio":1750,"Ġgun":1751,"ĠPakistan":1752,"ĠManagement":1753,"ĠAir":1754,"ce":1755,"Ġopposition":1756,"ment":1757,"ick":1758,"Ġpro":1759,"Ġact":1760,"Ġplatform":1761,"Ġlack":1762,"Ġpair":1763,"Ġ500":1764,"Ġcalling":1765,"ary":1766,"Ġprograms":1767,"Ġscheduled":1768,"Ġfast":1769,"Ġjoined":1770,"ĠWar":1771,"ĠEditing":1772,"ĠSince":1773,"ĠRyan":1774,"ĠMac":1775,"ĠBig":1776,"ĠLake":1777,"Ġdigital":1778,"When":1779,"ue":1780,"Ġassets":1781,"Ġseeing":1782,"ĠAct":1783,"Ġpartner":1784,"ĠBoard":1785,"Ġbeginning":1786,"Ġsupply":1787,"Ġmiles":1788,"Ġprison":1789,"ons":1790,"ĠAmericans":1791,"ub":1792,"ĠOr":1793,"me":1794,"Ġbenefits":1795,"Ġbenefit":1796,"Ġmeasures":1797,"Ġhear":1798,"Ġparties":1799,"Ġsuccessful":1800,"ĠJust":1801,"Ġvictim":1802,"Ġblock":1803,"Ġlimited":1804,"Ġtrip":1805,"ĠPeople":1806,"Ġserve":1807,"Ġart":1808,"ism":1809,"Ġwide":1810,"ĠSch":1811,"Ġ80":1812,"ĠThomas":1813,"Ġ90":1814,"Ġstocks":1815,"Ġgirl":1816,"ĠAsia":1817,"Ġseeking":1818,"Ġcertainly":1819,"ĠServices":1820,"ĠCollege":1821,"Ġcommunities":1822,"Ġextra":1823,"Ġ2010":1824,"ness":1825,"Ġholding":1826,"ous":1827,"Ġtough":1828,"ade":1829,"Ġmobile":1830,"Ġowns":1831,"ĠDo":1832,"ĠFire":1833,"Ġspoke":1834,"Ġreturned":1835,"Ġsize":1836,"Ġcriminal":1837,"ĠInstagram":1838,"Ġoffering":1839,"ĠGod":1840,"ĠService":1841,"Ġpage":1842,"her":1843,"Ġdeep":1844,"wood":1845,"Ġcrime":1846,"ĠSports":1847,"ile":1848,"ĠGlobal":1849,"Ġproposed":1850,"ain":1851,"Ġsession":1852,"ĠFederal":1853,"ĠSyria":1854,"Ġch":1855,"Ġthreat":1856,"Ġallegations":1857,"ĠRepublicans":1858,"ĠGerman":1859,"Ġstrategy":1860,"Ġcommercial":1861,"ING":1862,"ĠSecretary":1863,"Q":1864,"Ġreporters":1865,"100":1866,"ĠCapital":1867,"ĠBoth":1868,"ĠPost":1869,"ĠIsrael":1870,"Ġsave":1871,"ts":1872,"ill":1873,"Ġdrop":1874,"Ġreserved":1875,"ĠMany":1876,"Ġavoid":1877,"Ġ200":1878,"iv":1879,"Ġdamage":1880,"Ġcondition":1881,"Ġdropped":1882,"Ġdoor":1883,"Ġplanning":1884,"ire":1885,"Ġcard":1886,"Ġdesigned":1887,"Ġreduce":1888,"AN":1889,"ĠUn":1890,"ford":1891,"ĠThen":1892,"Ġpic":1893,"ĠCopyright":1894,"Ġrain":1895,"ĠMartin":1896,"Ġdomestic":1897,"45":1898,"ge":1899,"Ġmurder":1900,"Ġspeech":1901,"line":1902,"Ġhelping":1903,"Ġplanned":1904,"Ġfeature":1905,"ud":1906,"Ġtype":1907,"ham":1908,"ĠPublic":1909,"ja":1910,"Ġinsurance":1911,"Ġattacks":1912,"ĠCorp":1913,"Ġforecast":1914,"Ġresources":1915,"ma":1916,"?\"":1917,"ĠAm":1918,"ĠSept":1919,"Ġpush":1920,"Ġattorney":1921,"23":1922,"Ġemergency":1923,"Ġwinner":1924,"Ġblood":1925,"Ġnorth":1926,"ĠFeb":1927,"Ġbaby":1928,"Ġfloor":1929,"Ġspend":1930,"Ġex":1931,"Ġdollars":1932,"Ġunit":1933,"ĠHill":1934,"Ġder":1935,"ĠAbout":1936,"Ġalone":1937,"ization":1938,"Ġpresidential":1939,"Ġactivity":1940,"ĠTHE":1941,"ee":1942,"ber":1943,"ĠOther":1944,"Ġowner":1945,"Ġhour":1946,"Ġcities":1947,"Ġanswer":1948,"ide":1949,"Ġfully":1950,"ek":1951,"ists":1952,"Ġcoverage":1953,"Ġvs":1954,"Ġfigure":1955,"Ġpopulation":1956,"org":1957,"Ġsnow":1958,"Ġbecoming":1959,"ĠSam":1960,"ĠCarolina":1961,"Ġjoin":1962,"Ġprofit":1963,"Ġitems":1964,"Ġindex":1965,"Ġanalysis":1966,"Ġtournament":1967,"Ġstake":1968,"Ġperfect":1969,"way":1970,"Ġband":1971,"Ġgirls":1972,"Ġoption":1973,"Ġplays":1974,"oc":1975,"Ġproviding":1976,"ÃŃ":1977,"24":1978,"Ġwouldn":1979,"Ġones":1980,"Ġdeclined":1981,"Ġwritten":1982,"Ġvoters":1983,"Ġcandidate":1984,"Ġsuspect":1985,"Ġpolicies":1986,"Ġpeace":1987,"ast":1988,"Ġparticular":1989,"for":1990,"Ġhopes":1991,"Ġstation":1992,"ĠMost":1993,"Ġspeak":1994,"ĠRiver":1995,"Ġasking":1996,"Ġstatements":1997,"Ġfifth":1998,"ha":1999,"ĠNigeria":2000,"af":2001,"Ġexplained":2002,"Ġbar":2003,"Ġhousing":2004,"ĠSanta":2005,"Ġidentified":2006,"Ġsimple":2007,"Ġcritical":2008,"ĠClub":2009,"ĠSecurity":2010,"ĠLike":2011,"Ġstarts":2012,"art":2013,"Ġstreet":2014,"Ġreality":2015,"Ġheavy":2016,"Ġprogress":2017,"Ġshowing":2018,"Ġchallenges":2019,"Ġban":2020,"Ġcommitted":2021,"35":2022,"»":2023,"Ġdirectly":2024,"Ġaren":2025,"Ġclaim":2026,"ĠWestern":2027,"ind":2028,"Ġgives":2029,"ĠSaudi":2030,"Ġchoice":2031,"ĠTh":2032,"Ġapproved":2033,"Ġlocated":2034,"Ġarrived":2035,"22":2036,"Ġcaught":2037,"Ġprofessional":2038,"Ġmissed":2039,"Ġculture":2040,"ĠYear":2041,"ĠOhio":2042,"ĠLtd":2043,"ĠAnother":2044,"Ġseem":2045,"Ġbelieves":2046,"Ġbelieved":2047,"Ġcharacter":2048,"ĠAug":2049,"red":2050,"Ġfine":2051,"Ġprior":2052,"Ġthinking":2053,"Ġhttp":2054,"Ġ+":2055,"Ġzone":2056,"Ġputting":2057,"Ġcrash":2058,"ĠAustralian":2059,"ĠAb":2060,"Ġfocused":2061,"Ki":2062,"ĠFox":2063,"ĠSp":2064,"Ġtraditional":2065,"Ġanalyst":2066,"Ġwait":2067,"IT":2068,"Ġrequest":2069,"ru":2070,"ians":2071,"ize":2072,"Ġfinish":2073,"Ġlaws":2074,"Ġran":2075,"ER":2076,"Ġsouth":2077,"Ġspeed":2078,"Ġmovement":2079,"Ġassault":2080,"Ġexchange":2081,"Ġappear":2082,"ĠSun":2083,"Ġle":2084,"Ġmaybe":2085,"Ġlosing":2086,"Ġsubject":2087,"ive":2088,"mer":2089,"ĠBusiness":2090,"ĠBl":2091,"Ġappears":2092,"Ġadvantage":2093,"ĠLee":2094,"ada":2095,"ĠUnder":2096,"Ġprevent":2097,"Ġrespect":2098,"Ġsex":2099,"Ġcentre":2100,"ĠJoe":2101,"ado":2102,"Ġtable":2103,"Ġequipment":2104,"Ġfair":2105,"Ġtour":2106,"Ġ32":2107,"ĠFinancial":2108,"Ġcounty":2109,"Ġdevices":2110,"Ġcustomer":2111,"Ġinfrastructure":2112,"Ġexpectations":2113,"Ġfacing":2114,"Ġupon":2115,"Ġcross":2116,"ĠOpen":2117,"AL":2118,"Ġquick":2119,"Ġattempt":2120,"Ġcompleted":2121,"Ġfacility":2122,"Ġconfidence":2123,"ĠSupreme":2124,"Ġpiece":2125,"our":2126,"Ġplaces":2127,"Ġsometimes":2128,"Ġpoor":2129,"Ġstorm":2130,"Ġhot":2131,"Ġaffected":2132,"na":2133,"Ġabuse":2134,"ĠMs":2135,"Ġword":2136,"over":2137,"Ġbrother":2138,"Ġnecessary":2139,"Ġeventually":2140,"ĠStar":2141,"Ġsend":2142,"Ġboy":2143,"ĠRs":2144,"Ġremember":2145,"21":2146,"Ġclimate":2147,"Ġcapacity":2148,"Ġresponsible":2149,"ĠMatt":2150,"month":2151,"Ġsuffered":2152,"%.":2153,"og":2154,"ĠPeter":2155,"Ġ,":2156,"Ġfeeling":2157,"ze":2158,"Ġbuying":2159,"oy":2160,"ij":2161,"Ġbought":2162,"Ġactions":2163,"Ġowned":2164,"LaPadula":2165,"Ġphysical":2166,"Ġspecific":2167,"Ġbattle":2168,"ĠEnergy":2169,"Ġpicture":2170,"Ġactive":2171,"Ġindividuals":2172,"Ġguy":2173,"Ġregional":2174,"Ġbond":2175,"ows":2176,"ĠToronto":2177,"Ġrule":2178,"Ġdevelop":2179,"Ġcrowd":2180,"Ġguilty":2181,"Ġfemale":2182,"Ġselling":2183,"ĠFollow":2184,"Ġmyself":2185,"ata":2186,"Ġdevice":2187,"Ġreasons":2188,"Ġrecords":2189,"Ġfighting":2190,"ON":2191,"ities":2192,"ĠHome":2193,"Ġstatus":2194,"Ġplant":2195,"Ġdrugs":2196,"ĠChurch":2197,"Ġcompletely":2198,"Ġdisease":2199,"Ġhighly":2200,"ĠParis":2201,"Ġdecade":2202,"Ġowners":2203,"Ġwall":2204,"Ġcamp":2205,"ĠSteve":2206,"Ġreporting":2207,"Ġearned":2208,"ĠImages":2209,"Ġexisting":2210,"ĠSen":2211,"Ġconcern":2212,"Ġhundreds":2213,"Ġsong":2214,"Ġknows":2215,"Ġunique":2216,"Ġlose":2217,"ĠKh":2218,"Ġapproximately":2219,"Ġhaven":2220,"Ġpark":2221,"Ġindependent":2222,"ĠAlthough":2223,"ĠAndrew":2224,"Ġpaper":2225,"Ġdeveloped":2226,"Ġrising":2227,"Ġdirect":2228,"Ġpurchase":2229,"Ġexactly":2230,"Ġq":2231,"Ġmassive":2232,"Ġbox":2233,"Ġchampion":2234,"ĠClinton":2235,"Ġvoice":2236,"Ġarrest":2237,"ĠKorean":2238,"Ġlearning":2239,"ĠVirginia":2240,"Ġsa":2241,"Ġpar":2242,"Ġchairman":2243,"Ġagencies":2244,"Ġhealthy":2245,"ĠThose":2246,"Ġpowerful":2247,"Ġ45":2248,"Ġdifference":2249,"ĠJackson":2250,"Ġenforcement":2251,"MILP":2252,"qu":2253,"Ġenjoy":2254,"Ġruling":2255,"Ġongoing":2256,"Ġsoftware":2257,"ks":2258,"Ġlocation":2259,"Ġmostly":2260,"Ġcandidates":2261,"men":2262,"Ġbroke":2263,"What":2264,"ĠBr":2265,"Ġ2008":2266,"Ġconsumer":2267,"Ġdiscuss":2268,"Ġdi":2269,"Ġprimary":2270,"ĠEn":2271,"Ġgreen":2272,"Ġconcerned":2273,"Ġimage":2274,"ĠPremier":2275,"ĠMeanwhile":2276,"Ġfired":2277,"ĠBoston":2278,"ann":2279,"Ġcamera":2280,"Ġtraded":2281,"Ġhasn":2282,"Ġexcited":2283,"Ġincreasing":2284,"ĠDespite":2285,"Ġcitizens":2286,"Ġeuro":2287,"Ġreportedly":2288,"Ġminute":2289,"ĠWill":2290,"ĠLLC":2291,"Ġsp":2292,"ĠMichigan":2293,"Ġstopped":2294,"Ġeye":2295,"Ġdenied":2296,"Ġmodern":2297,"ĠWall":2298,"Ġdefinitely":2299,"point":2300,"Ġlines":2301,"Ġpolitics":2302,"Ġhotel":2303,"Ġretail":2304,"Ġstated":2305,"ĠOver":2306,"Ġgrew":2307,"Ġbroadcast":2308,"Ġlegislation":2309,"Ġfresh":2310,"Ġbid":2311,"Ġmanaged":2312,"Ġsociety":2313,"Ġscoring":2314,"ĠGet":2315,"Ġintelligence":2316,"Ġholiday":2317,"Ġgovernor":2318,"Ġestimated":2319,"Ġexperts":2320,"ĠJeff":2321,"Ġstruck":2322,"Ġhits":2323,"Ġcarry":2324,"Ġplaced":2325,"Ġstores":2326,"Ġexpressed":2327,"Ġvalued":2328,"Ġad":2329,"Ġtwice":2330,"ala":2331,"Ġdisplay":2332,"Ġusually":2333,"Ġresponded":2334,"Ġdog":2335,"AS":2336,"ĠFed":2337,"Ġ2009":2338,"Ġdocuments":2339,"Ġnormal":2340,"Ġtrain":2341,"Ġfl":2342,"Ġshown":2343,"ĠEd":2344,"Ġsort":2345,"Ġallegedly":2346,"Ġshots":2347,"ka":2348,"Ġaccounts":2349,"Ġyesterday":2350,"Ġcreating":2351,"Ġchurch":2352,"Ġbus":2353,"Ġaward":2354,"Ġequity":2355,"Ġphotos":2356,"Ġ33":2357,"Ġfiscal":2358,"je":2359,"Ġconsumers":2360,"ĠManchester":2361,"no":2362,"ĠKevin":2363,"Ġgain":2364,"Ġcorporate":2365,"Ġcivil":2366,"ĠMiddle":2367,"ally":2368,"Ġsound":2369,"ĠEnglish":2370,"IC":2371,"Ġwinds":2372,"Ġworst":2373,"ĠGrand":2374,"Ġeffective":2375,"ĠIsland":2376,"Ġdrivers":2377,"Ġfan":2378,"pe":2379,"Ġsides":2380,"ĠGo":2381,"Ġclean":2382,"âĢĵ":2383,"Ġtelevision":2384,"ĠJr":2385,"Ġallows":2386,"My":2387,"Ġgreater":2388,"ance":2389,"Ġdecisions":2390,"Ġrestaurant":2391,"ĠHospital":2392,"ĠTr":2393,"Ġbalance":2394,"Ġmph":2395,"Ġkeeping":2396,"Ġseconds":2397,"Ġweapons":2398,"ert":2399,"Ġpain":2400,"ass":2401,"Ġsteps":2402,"ger":2403,"ĠBrexit":2404,"Ġremaining":2405,"Ġbringing":2406,"ure":2407,"Ġweight":2408,"And":2409,"Ġwriting":2410,"NNs":2411,"ĠChristian":2412,"ob":2413,"Ġsport":2414,"Ġfigures":2415,"Ġtrust":2416,"Ġskills":2417,"Ġseat":2418,"Ġfaces":2419,"ck":2420,"Ġborn":2421,"Ġsuper":2422,"Ġfuel":2423,"Ġdel":2424,"Ġmeant":2425,"ica":2426,"Ġjustice":2427,"Ġspring":2428,"Ġkilling":2429,"Ġnegative":2430,"ĠRichard":2431,"Ġund":2432,"Ġfactors":2433,"Ġsigns":2434,"Ġlearned":2435,"ĠGame":2436,"Ġaudience":2437,"Ġdeliver":2438,"Ġillegal":2439,"Ġblue":2440,"Ġscreen":2441,"Ġremained":2442,"Ġannouncement":2443,"IN":2444,"Ġwaiting":2445,"Ġthanks":2446,"Ġimmigration":2447,"ĠFBI":2448,"Ġwarned":2449,"Ġmeasure":2450,"Ġdraw":2451,"Ġpositions":2452,"Ġdebut":2453,"ĠMedia":2454,"Ġallowing":2455,"air":2456,"hen":2457,"Ġmark":2458,"ys":2459,"Ġprepared":2460,"ĠVegas":2461,"ep":2462,"ice":2463,"2018":2464,"Ġdefensive":2465,"60":2466,"ĠBeach":2467,"Ġpulled":2468,"£":2469,"Ġlawyer":2470,"Ġcast":2471,"Ġsolution":2472,"Ġeyes":2473,"Ġmarketing":2474,"ĠFoundation":2475,"Ġrisks":2476,"ĠToday":2477,"za":2478,"Ġdraft":2479,"Ġice":2480,"26":2481,"ĠHar":2482,"ĠExecutive":2483,"Ġtruck":2484,"ions":2485,"ĠYour":2486,"ĠIreland":2487,"ĠJim":2488,"Ġha":2489,"Ġfear":2490,"Ġ36":2491,"UR":2492,"ĠFord":2493,"Ġwatching":2494,"ien":2495,"Ġstyle":2496,"ĠGood":2497,"Ġwearing":2498,"ĠHouston":2499,"Ġonto":2500,"Ġboost":2501,"Ġapplication":2502,"ĠDan":2503,"Ġspread":2504,"ĠDavis":2505,"Ġstrike":2506,"els":2507,"Ġwind":2508,"Ġinterested":2509,"Ġguard":2510,"Ġmission":2511,"Ġyourself":2512,"Ġoperation":2513,"Ġlarger":2514,"She":2515,"Ġseasons":2516,"28":2517,"27":2518,"Ġrespond":2519,"ci":2520,"ĠCentre":2521,"Our":2522,"Ġnames":2523,"Ġflight":2524,"ORP":2525,"Ġstandard":2526,"so":2527,"Ġsuggested":2528,"ĠMal":2529,"Ġolder":2530,"ini":2531,"Ġperhaps":2532,"ont":2533,"ĠInstitute":2534,"Ġmillions":2535,"Ġmental":2536,"OUD":2537,"ga":2538,"Ġclients":2539,"Ġplease":2540,"Ġloan":2541,"Ġaware":2542,"ft":2543,"int":2544,"75":2545,"05":2546,"AY":2547,"ĠOut":2548,"Ġhair":2549,"ied":2550,"Ġseemed":2551,"ene":2552,"ty":2553,"Ow":2554,"Ġoffensive":2555,"Ġtaxes":2556,"Ġinitial":2557,"ren":2558,"Ġseparate":2559,"la":2560,"ĠMiami":2561,"AC":2562,"Ġclearly":2563,"Ġfit":2564,"ĠCoast":2565,"Ġfirms":2566,"Ġpartners":2567,"Ġupcoming":2568,"Ġcold":2569,"Ġproposal":2570,"AT":2571,"Ġshut":2572,"ĠCommunity":2573,"Ġnature":2574,"ĠSal":2575,"Ġbottom":2576,"ting":2577,"ĠClick":2578,"Ġnice":2579,"ets":2580,"Ġhurt":2581,"itt":2582,"ama":2583,"Ġcarried":2584,"ĠCon":2585,"rd":2586,"Ġestate":2587,"ĠLas":2588,"ĠLaw":2589,"ng":2590,"Ġprotection":2591,"Ġproduce":2592,"Ġcurrency":2593,"Ġhappens":2594,"ĠPer":2595,"ney":2596,"ĠLong":2597,"Ġfellow":2598,"Ġcuts":2599,"Ġreading":2600,"ano":2601,"Ġproud":2602,"ost":2603,"ĠUN":2604,"ĠArizona":2605,"AD":2606,"Ġhelps":2607,"Ġwinter":2608,"Ġfinding":2609,"ĠGold":2610,"att":2611,"ĠWhy":2612,"Ġbasketball":2613,"lin":2614,"ĠCan":2615,"ĠBowl":2616,"ial":2617,"ĠAlex":2618,"200":2619,"AM":2620,"Ġpresence":2621,"Ġproduced":2622,"Ġdeveloping":2623,"Ġregarding":2624,"Ġdebate":2625,"Ġvice":2626,"ĠItaly":2627,"Ġsu":2628,"its":2629,"ator":2630,"Ġ34":2631,"Ġcomplex":2632,"Ġpresented":2633,"Ġresearchers":2634,"Ġslow":2635,"ya":2636,"Ġsanctions":2637,"Ġloved":2638,"Ġseek":2639,"Ġresponsibility":2640,"Ġadmitted":2641,"Ġalbum":2642,"Ġsolutions":2643,"Ġfacilities":2644,"ett":2645,"ĠGu":2646,"ĠWell":2647,"Ġlawmakers":2648,"Ġmiss":2649,"ful":2650,"ĠNick":2651,"'.":2652,"Ġfeels":2653,"Ġprime":2654,"Ġknowledge":2655,"Ġdeals":2656,"ĠTaylor":2657,"Ġsurvey":2658,"ĠFrancisco":2659,"Ġjoint":2660,"Ġwhom":2661,"Ġsit":2662,"01":2663,"Ġtr":2664,"Ġorganizations":2665,"ĠAvenue":2666,"ĠTheir":2667,"ĠTim":2668,"Ġrally":2669,"game":2670,"Ġbigger":2671,"Ġlawsuit":2672,"Ġrecorded":2673,"Ġfavorite":2674,"yard":2675,"Ġtransaction":2676,"Ġqu":2677,"oh":2678,"Ġinteresting":2679,"Ġinflation":2680,"ath":2681,"Ġstuff":2682,"Ġindustrial":2683,"ico":2684,"TS":2685,"Ġspeaking":2686,"Ġlosses":2687,"ID":2688,"ĠStadium":2689,"Ġstars":2690,"ĠWomen":2691,"ĠBlue":2692,"Ġwins":2693,"Ġdes":2694,"Ġcompetitive":2695,"ters":2696,"Ġpounds":2697,"Ġdirection":2698,"Passport":2699,"ĠBest":2700,"Ġactor":2701,"Ġdangerous":2702,"Ġrequire":2703,"Ġplus":2704,"Ġsolid":2705,"Ġgeneration":2706,"Ġstrength":2707,"ĠMary":2708,"For":2709,"Ġplenty":2710,"ĠTeam":2711,"Ġinfluence":2712,"Ġfaced":2713,"Ġes":2714,"ĠIslamic":2715,"let":2716,"ĠDevelopment":2717,"Ġpath":2718,"Ġyouth":2719,"Ġcommitment":2720,"Ġbeautiful":2721,"ĠJack":2722,"ort":2723,"Ġten":2724,"Ġattend":2725,"ars":2726,"Ã³n":2727,"Ġviews":2728,"Ġeuros":2729,"Ġauthor":2730,"Ġcore":2731,"Ġsupporters":2732,"ĠiPhone":2733,"Ġfashion":2734,"Ġsmaller":2735,"Ġelected":2736,"Ġuniversity":2737,"Ġpicked":2738,"wa":2739,"Ġordered":2740,"ĠSc":2741,"Pkt":2742,"Ġlargely":2743,"+":2744,"ĠAttorney":2745,"Ġpaying":2746,"AR":2747,"Ġconnection":2748,"Ġsetting":2749,"Ġna":2750,"ĠRock":2751,"Ġrecovery":2752,"ew":2753,"Ġserving":2754,"Ġsurprise":2755,"Ġoccurred":2756,"Ġdivision":2757,"Ġtelling":2758,"Ġmargin":2759,"Ġ2020":2760,"Ġsister":2761,"ĠNBA":2762,"Ġvoted":2763,"Ġcon":2764,"By":2765,"Ġ49":2766,"Ġfoot":2767,"Ã¼":2768,"ĠTurkey":2769,"Ġamazing":2770,"Ġcombined":2771,"Ġappearance":2772,"Ġeasily":2773,"Proc":2774,"Ġnotes":2775,"ĠStart":2776,"Ġlanguage":2777,"Ġextremely":2778,"Programs":2779,"ĠLet":2780,"Ġdelivered":2781,"Ġimproved":2782,"Ġcollection":2783,"ĠPM":2784,"Ġestimates":2785,"Ġboys":2786,"izing":2787,"Ġtext":2788,"Ġcloser":2789,"Ġprotest":2790,"Ġprovince":2791,"Ġshop":2792,"Ġsmart":2793,"de":2794,"ĠSheriff":2795,"EN":2796,"Ġcorner":2797,"Ġpanel":2798,"Ġbooks":2799,"Ġsupported":2800,"Ġmentioned":2801,"ver":2802,"ĠMinistry":2803,"ĠPrince":2804,"ĠUSA":2805,"Ġreceiving":2806,"Ġchoose":2807,"ĠIN":2808,"ĠSpain":2809,"Ġsection":2810,"Ġconsidering":2811,"ĠCor":2812,"Ġwish":2813,"Ġwelcome":2814,"ĠConference":2815,"ere":2816,"ĠOfficer":2817,"Ġhoping":2818,"Ġportfolio":2819,"Ġstandards":2820,"Ġgrand":2821,"ĠReal":2822,"Ġsecure":2823,"ĠCorporation":2824,"ĠRep":2825,"ĠKelly":2826,"Ġstreets":2827,"Ġsitting":2828,"Ġslightly":2829,"ĠInvestment":2830,"99":2831,"ond":2832,"Ġunits":2833,"Ġvotes":2834,"Ġsegment":2835,"Ġchampionship":2836,"Ġsquad":2837,"iting":2838,"ron":2839,"®":2840,"Ġem":2841,"Ġtouch":2842,"Ġ38":2843,"Ġceremony":2844,"Ġdecide":2845,"Ġapproval":2846,"So":2847,"ĠPort":2848,"Ġsub":2849,"Ġsc":2850,"Ġrep":2851,"ĠWeek":2852,"Ġupper":2853,"Ġagree":2854,"ny":2855,"Ġmatches":2856,"ics":2857,"Ġtweeted":2858,"Ġheat":2859,"ĠGreat":2860,"Ġpenalty":2861,"Ġmass":2862,"Ġalongside":2863,"Ġherself":2864,"berg":2865,"Ġscience":2866,"Ġentered":2867,"Ġappeal":2868,"ĠPr":2869,"Ġfile":2870,"che":2871,"ĠReport":2872,"ĠThree":2873,"ĠNorthern":2874,"ĠJordan":2875,"Ġamid":2876,"Ġpace":2877,"Ġjail":2878,"Ġfinance":2879,"ĠYoung":2880,"32":2881,"Ġwilling":2882,"Ġconduct":2883,"ĠPar":2884,"Ġestablished":2885,"Ġreturns":2886,"Ġaid":2887,"Ġinternet":2888,"IA":2889,"29":2890,"Ġmeetings":2891,"Ġwarning":2892,"ĠCl":2893,"Ġcampus":2894,"Most":2895,"ĠFund":2896,"ĠWilliam":2897,"ĠJapanese":2898,"Ġconsensus":2899,"Ġbrain":2900,"!\"":2901,"Ġpoll":2902,"Ġtech":2903,"Ġtrend":2904,"Ġpotentially":2905,"Ġreduced":2906,"ĠShow":2907,"Ġ37":2908,"Ġhappening":2909,"ĠBrazil":2910,"pl":2911,"ĠCal":2912,"Ġcovered":2913,"Ġenter":2914,"TV":2915,"Ġcatch":2916,"foot":2917,"Ġunion":2918,"Ġexpansion":2919,"ĠSingapore":2920,"ĠDetroit":2921,"Ġattended":2922,"ats":2923,"Ġnewspaper":2924,"ĠDivision":2925,"news":2926,"Ġcap":2927,"Ġremoved":2928,"Ġ48":2929,"ĠRoyal":2930,"Ġwindow":2931,"Ġparking":2932,"Ġdark":2933,"Ġstanding":2934,"Ġupdate":2935,"Ġagent":2936,"Ġtransfer":2937,"ĠArmy":2938,"Ġuses":2939,"80":2940,"ĠTe":2941,"Ġintroduced":2942,"Ġmale":2943,"ĠSouthern":2944,"Ġratings":2945,"Ġisland":2946,"ĠMiller":2947,"Ġteachers":2948,"Ġadvice":2949,"Ġfamiliar":2950,"uf":2951,"Ġsought":2952,"Ġpor":2953,"ĠEric":2954,"Ġda":2955,"Ġideas":2956,"uh":2957,"Ġsixth":2958,"Ġtalent":2959,"ĠImage":2960,"ering":2961,"run":2962,"ments":2963,"Ġconducted":2964,"300":2965,"Ġurged":2966,"Ġdiscovered":2967,"Ġpl":2968,"Ġunderstanding":2969,"Ġoffense":2970,"Ġsecretary":2971,"Ġsk":2972,"Ġloans":2973,"ĠGr":2974,"Ġapplications":2975,"Ġcrude":2976,"go":2977,"ĠInstead":2978,"Ġopinion":2979,"Ġdoubt":2980,"ey":2981,"Ġdis":2982,"31":2983,"Ġexperienced":2984,"Ġleg":2985,"ĠCleveland":2986,"ven":2987,"Ġfailure":2988,"market":2989,"ack":2990,"Ġdecline":2991,"Ġchanging":2992,"Ġ300":2993,"Ġdefence":2994,"ĠBrian":2995,"Ġdelivery":2996,"Ġmarried":2997,"Ġdeclared":2998,"Ġpull":2999,"Ġlimit":3000,"ĠMORE":3001,"Ġdefeat":3002,"Ġexpand":3003,"ĠColorado":3004,"ĠRob":3005,"iss":3006,"Ġworse":3007,"Ġperform":3008,"ising":3009,"Ġ2007":3010,"ĠDel":3011,"Ġsurgery":3012,"Ġeasier":3013,"Ġmaintain":3014,"ĠEx":3015,"Ġtied":3016,"Ġeast":3017,"Ġuser":3018,"ola":3019,"Ġprogramme":3020,"Ġmanufacturing":3021,"Ġhitting":3022,"Ġx":3023,"Ġskin":3024,"Ġartist":3025,"Ġtells":3026,"Ġnearby":3027,"ĠDaniel":3028,"ĠPower":3029,"Ġdetermined":3030,"Ġactual":3031,"Ġtreated":3032,"Ġlived":3033,"Ġcomputer":3034,"Ġcool":3035,"oo":3036,"ĠPl":3037,"Ġeffects":3038,"Ġenvironmental":3039,"ĠMorgan":3040,"Ġflow":3041,"Ġachieve":3042,"ĠBell":3043,"Ġtesting":3044,"ĠBob":3045,"Ġwhatever":3046,"ĠBecause":3047,"US":3048,"ĠHollywood":3049,"Ġconflict":3050,"Ġwalking":3051,"ĠJudge":3052,"ĠAlabama":3053,"Ġaircraft":3054,"Ġte":3055,"well":3056,"Ġgoods":3057,"Ġidentify":3058,"Ġassociated":3059,"ĠVer":3060,"ĠEducation":3061,"Ġairport":3062,"IL":3063,"Ġfalling":3064,"Ġgiant":3065,"ĠMa":3066,"ĠMedical":3067,"Ġride":3068,"Ġden":3069,"º":3070,"ĠJose":3071,"Ġwest":3072,"ĠPacific":3073,"Ġvisitors":3074,"ĠWatch":3075,"ĠNations":3076,"Ġgains":3077,"Ġschedule":3078,"34":3079,"ĠExchange":3080,"Ġpayments":3081,"ĠII":3082,"70":3083,"No":3084,"ĠSyrian":3085,"ĠAdam":3086,"Ġne":3087,"Ġpartnership":3088,"Ġbl":3089,"ĠGeorgia":3090,"Ġsites":3091,"Ġmodels":3092,"Ġdegree":3093,"Ġdetermine":3094,"ĠWilson":3095,"Ġcontest":3096,"Ġprofessor":3097,"SMA":3098,"Ġmeaning":3099,"ĠGames":3100,"ĠTrust":3101,"ĠAsian":3102,"33":3103,"Ġlink":3104,"ĠUp":3105,"Ġholds":3106,"ĠTop":3107,"ĠItalian":3108,"ord":3109,"ĠKansas":3110,"Ġfarmers":3111,"Ġextended":3112,"Ġbirth":3113,"Ġreform":3114,"Ġrelations":3115,"Ġwrite":3116,"Ġsupporting":3117,"55":3118,"ita":3119,"Ġnotice":3120,"ster":3121,"Ġanimals":3122,"ĠJersey":3123,"Ġarm":3124,"ĠForeign":3125,"ĠLife":3126,"Ġtruly":3127,"ĠOnce":3128,"ĠMayor":3129,"ĠFree":3130,"ĠAgency":3131,"ĠWood":3132,"Ġpassing":3133,"DA":3134,"Ġ52":3135,"Ġmoves":3136,"Ġcom":3137,"house":3138,"ĠIts":3139,"Ġmarijuana":3140,"ines":3141,"Ġveteran":3142,"Ġvariety":3143,"ki":3144,"ff":3145,"amb":3146,"Ġlisted":3147,"Ġpushed":3148,"Ġvolume":3149,"Ġincreasingly":3150,"Ġkick":3151,"Ġrock":3152,"ank":3153,"Ġfees":3154,"Ġenable":3155,"Ġimages":3156,"Ġtruth":3157,"Ġministry":3158,"Ġrare":3159,"ĠDallas":3160,"ĠMinnesota":3161,"Ġcontributed":3162,"ĠCharles":3163,"Ġpercentage":3164,"Ġtechnical":3165,"ĠApp":3166,"Ġassistant":3167,"Ġinterests":3168,"Ġimmediate":3169,"38":3170,"ĠTown":3171,"Ġclosing":3172,"ĠAnthony":3173,"Ġsouthern":3174,"ase":3175,"ĠPutin":3176,"ĠForce":3177,"ba":3178,"Ġrefused":3179,"ĠStill":3180,"ix":3181,"ĠCol":3182,"Ġmaterials":3183,"Ġstructure":3184,"Ġdriven":3185,"Ġpatient":3186,"Ġbroken":3187,"Ġradio":3188,"Ġscale":3189,"Ġreplace":3190,"Ġ39":3191,"ĠLand":3192,"Ġdeputy":3193,"und":3194,"Ġcolor":3195,"OS":3196,"Ġroads":3197,"Ġcorruption":3198,"ĠRose":3199,"Ġemployee":3200,"ĠWater":3201,"Ġseats":3202,"Ġwalked":3203,"ec":3204,"Ġcents":3205,"Ġchain":3206,"Ġpayment":3207,"ĠAndroid":3208,"eb":3209,"Ġcommission":3210,"Ġthrow":3211,"Ġcount":3212,"Ġaccident":3213,"Ġexpensive":3214,"ered":3215,"ĠYes":3216,"ĠLouis":3217,"Ġstudies":3218,"Ġinvestigating":3219,"Ġcentury":3220,"Ġdiscussion":3221,"Ġinter":3222,"DAQ":3223,"ĠBefore":3224,"Ġinitially":3225,"*":3226,"Ġinvestments":3227,"Ġmulti":3228,"Ġtight":3229,"Ġconfident":3230,"Ġcounter":3231,"ĠQu":3232,"Ġgovernments":3233,"Ġarmed":3234,"Ġsuit":3235,"Ġrow":3236,"Ġlocations":3237,"Ġepisode":3238,"itch":3239,"Ġyounger":3240,"Ġfestival":3241,"Ġpitch":3242,"ĠOF":3243,"Ġtalked":3244,"ca":3245,"Ġprotests":3246,"Ġtargets":3247,"90":3248,"Ġoriginally":3249,"Ġsinger":3250,"Ġjourney":3251,"ug":3252,"Ġapply":3253,"Ġteacher":3254,"Ġchances":3255,"):":3256,"Ġdeaths":3257,"isation":3258,"ĠStephen":3259,"Ġcode":3260,"Smirnov":3261,"ĠJason":3262,"ĠAT":3263,"Ġaccept":3264,"ĠSeries":3265,"Ġvalues":3266,"Ġbed":3267,"ĠHarry":3268,"Ġflat":3269,"Ġtools":3270,"Ġpublicly":3271,"37":3272,"Ġpointed":3273,"ĠGolden":3274,"ps":3275,"Ġunable":3276,"ants":3277,"Ġestimate":3278,"Ġwarm":3279,"Ġbasic":3280,"ern":3281,"Ġraising":3282,"ĠRelated":3283,"Ġultimately":3284,"Ġnorthern":3285,"Ġplane":3286,"ĠVice":3287,"ĠRaj":3288,"ĠJustin":3289,"anc":3290,"Ġbrings":3291,"ĠArt":3292,"OT":3293,"Ġshift":3294,"ĠBBC":3295,"ĠSu":3296,"BS":3297,"Ġbag":3298,"Ġdoctor":3299,"Ġfill":3300,"Ġdowntown":3301,"Ġpossibility":3302,"ĠAg":3303,"Ġest":3304,"44":3305,"Ġstruggling":3306,"Ġlinked":3307,"Ġtickets":3308,"ĠJay":3309,"ĠCall":3310,"Ġstands":3311,"Ġwedding":3312,"Ġresident":3313,"eng":3314,"Ġleads":3315,"Ġadvance":3316,"ĠAtlanta":3317,"Ġtie":3318,"Ġadvanced":3319,"pt":3320,"burg":3321,"ĠEarlier":3322,"ĠSw":3323,"ĠZealand":3324,"Ġexercise":3325,"ĠAM":3326,"Ġaffect":3327,"Ġpossession":3328,"Ġinvolving":3329,"Ġ42":3330,"Ġwriter":3331,"ĠBeijing":3332,"Ġdoctors":3333,"Ġobviously":3334,"Ġer":3335,"ĠOlympic":3336,"Ġ75":3337,"ĠKhan":3338,"ĠFort":3339,"app":3340,"like":3341,"Ġsea":3342,"ock":3343,"Ġmix":3344,"ĠIraq":3345,"ĠMuslim":3346,"ĠFinally":3347,"Ġcontinuing":3348,"Ġpr":3349,"ĠKe":3350,"ĠJoseph":3351,"Ġexpects":3352,"Ġinstitutions":3353,"Ġconservative":3354,"own":3355,"ĠChairman":3356,"Ġreturning":3357,".-":3358,"Ġstood":3359,"Ġvision":3360,"ess":3361,"Ġadults":3362,"Ġyield":3363,"Ġprove":3364,"Ġorders":3365,"Ġdream":3366,"36":3367,"related":3368,"Ġsl":3369,"Ġeverybody":3370,"ui":3371,"Ġrepresents":3372,"Ġdiscussed":3373,"Ġbecomes":3374,"Ġvillage":3375,"CC":3376,"Ġnegotiations":3377,"ĠPhiladelphia":3378,"Ġcelebrate":3379,"Ġfarm":3380,"Ã§":3381,"Ġregistered":3382,"ĠGovernor":3383,"OL":3384,"ĠMon":3385,"Ġfiling":3386,"04":3387,"SE":3388,"ĠAssembly":3389,"Ġactress":3390,"Ġsi":3391,"Ġthank":3392,"Ġheading":3393,"ĠWho":3394,"Ġfamous":3395,"Ġconsecutive":3396,"Ġmarriage":3397,"ette":3398,"NAS":3399,"acks":3400,"ĠPlease":3401,"ĠDiego":3402,"Ġbaseball":3403,"ĠMoore":3404,"Ġties":3405,"Ġcarrying":3406,"que":3407,"Ġturning":3408,"ĠMcC":3409,"ĠKen":3410,"OR":3411,"ĠStock":3412,"Ġbuildings":3413,"49":3414,"ĠVan":3415,"39":3416,"ĠSeattle":3417,"Ġwild":3418,"Ġcrew":3419,"Ġroute":3420,"ĠTime":3421,"Traffic":3422,"Ġmoments":3423,"Ġvideos":3424,"Ġinternal":3425,"Tram":3426,"port":3427,"Ġchair":3428,"Ġrival":3429,"ĠScotland":3430,"round":3431,"ith":3432,"Ġbreaking":3433,"Ġvoting":3434,"ically":3435,"Ġproducer":3436,"ĠLove":3437,"Ġremove":3438,"PA":3439,"Ġasset":3440,"Ġrequires":3441,"Ġsigning":3442,"ages":3443,"Ġimpressive":3444,"ĠIrish":3445,"Ġauthority":3446,"Ġruled":3447,"Ġaimed":3448,"Ġcaptain":3449,"AG":3450,"Ġplants":3451,"ĠAnderson":3452,"ĠSpanish":3453,"Ġbanking":3454,"Ġthreats":3455,"Ġsuspended":3456,"Ġtests":3457,"Ġreligious":3458,"Ġelectric":3459,"ĠREAD":3460,"Ġstrategic":3461,"Ġsplit":3462,"ex":3463,"Ġpractices":3464,"ĠIsraeli":3465,"ĠArabia":3466,"ĠMoscow":3467,"Ġfranchise":3468,"Ġcustody":3469,"ĠOld":3470,"Ġrequirements":3471,"Ġquarterly":3472,"Ġcomfortable":3473,"Ġcrimes":3474,"Ġheaded":3475,"Ġnewsletter":3476,"Ġanimal":3477,"Ġregulations":3478,"long":3479,"ĠCNN":3480,"Ġassists":3481,"Ġshopping":3482,"ĠGov":3483,"ĠSecurities":3484,"Ġassistance":3485,"Ġnor":3486,"Ġrelatively":3487,"Ġincreases":3488,"Ġgenerally":3489,"Ġ55":3490,"Ġgained":3491,"Ġ41":3492,"Ġpictures":3493,"gan":3494,"Ġpop":3495,"Ġupdates":3496,"ĠRepublic":3497,"USERS":3498,"ĠPatrick":3499,"Ġrelief":3500,"Ġacting":3501,"ĠFestival":3502,"Ġ2006":3503,"Ġboss":3504,"Ġtypes":3505,"65":3506,"ĠYet":3507,"Ġpurpose":3508,"ning":3509,"Ġmatters":3510,"Ġcompete":3511,"ball":3512,"ĠRam":3513,"Ġsw":3514,"ĠFollowing":3515,"ĠBush":3516,"Ġtroops":3517,"Ġsupposed":3518,"Ġfreedom":3519,"Ġfeatured":3520,"Ġstorage":3521,"ĠInformation":3522,"ĠHong":3523,"Ġgolf":3524,"Ġagents":3525,"Ġfraud":3526,"Ġminimum":3527,"Ġartists":3528,"Ġeat":3529,"high":3530,"ĠFormer":3531,"ĠKong":3532,"ĠJosh":3533,"ĠDelhi":3534,"VLAN":3535,"ĠAcademy":3536,"Ġapartment":3537,"Ġvan":3538,"Ġfish":3539,"oe":3540,"Ġfilms":3541,"ĠBo":3542,"Ġedge":3543,"Ġpossibly":3544,"Ġtweet":3545,"09":3546,"Ġresolution":3547,"jo":3548,"Ġkill":3549,"Ġ44":3550,"Ġcell":3551,"Ġscheme":3552,"Ġth":3553,"Ġbonds":3554,"Ġentry":3555,"Ġsecret":3556,"Ġ43":3557,"Ġending":3558,"Ġweren":3559,"ĠCredit":3560,"ĠLive":3561,"Ġretired":3562,"Ġmachine":3563,"Ġsummit":3564,"Ġsharing":3565,"Ġacquired":3566,"Ġera":3567,"Ġwear":3568,"ical":3569,"07":3570,"Ġexciting":3571,"li":3572,"BC":3573,"ĠSocial":3574,"Ġhistoric":3575,"ĠChe":3576,"ĠLewis":3577,"ira":3578,"Ġstolen":3579,"ĠSpeaking":3580,"Ġsleep":3581,"Ġspokeswoman":3582,"week":3583,"Ġpurchased":3584,"Ġimportance":3585,"EC":3586,"Ġends":3587,"Ġdress":3588,"Ġparliament":3589,"ĠCruz":3590,"Ġcards":3591,"hi":3592,"ĠEmail":3593,"Ġrepresent":3594,"Ġbrands":3595,"ĠSenior":3596,"Ġparticipants":3597,"Ġfly":3598,"Ġidentity":3599,"ĠHam":3600,"ĠSky":3601,"ĳ":3602,"SA":3603,"Ġpromised":3604,"Ġtrouble":3605,"Ġsuffering":3606,"Ġleaves":3607,"Ġsuggest":3608,"Sh":3609,"Ġbusy":3610,"Ġproperties":3611,"Ġworldwide":3612,"Ġcloud":3613,"ĠSEC":3614,"Ġclosely":3615,"Ġmanage":3616,"Ġnumerous":3617,"Ġbackground":3618,"ĠExpress":3619,"Ġ65":3620,"ĠTony":3621,"ĠMadrid":3622,"ev":3623,"der":3624,"Ġsignificantly":3625,"Ġalternative":3626,"Ġship":3627,"head":3628,"ators":3629,"Ġdinner":3630,"ax":3631,"SC":3632,"Ġcriticism":3633,"ĠMah":3634,"ĠMin":3635,"rie":3636,"ĠTour":3637,"Ġbench":3638,"Ġadds":3639,"Ġseriously":3640,"star":3641,"ĠJournal":3642,"ĠDi":3643,"ali":3644,"Ġsentence":3645,"ĠSeveral":3646,"Ġmayor":3647,"ati":3648,"Ġsuggests":3649,"Ġbehavior":3650,"Ġstronger":3651,"ĠFood":3652,"Ġclient":3653,"not":3654,"ĠPrice":3655,"Ġtargeted":3656,"ĠSingh":3657,"ĠNetwork":3658,"Ġprosecutors":3659,"Ġdirected":3660,"ĠDemocrat":3661,"bl":3662,"ues":3663,"ĠFamily":3664,"Ġconnected":3665,"ĠChampions":3666,"Ġroughly":3667,"Ġabsolutely":3668,"08":3669,"Ġpassengers":3670,"Ã¶":3671,"ĠSpecial":3672,"Ġcoast":3673,"Ġcomplaint":3674,"Ġ400":3675,"ĠEm":3676,"ves":3677,"Ġdogs":3678,"Ġhandle":3679,"Ġotherwise":3680,"Ġsees":3681,"Ġticket":3682,